Revit 2025 API
WorksetTable.GetActiveWorksetId Method
 Returns the active workset's WorksetId.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public WorksetId GetActiveWorksetId()
Public Function GetActiveWorksetId As WorksetId
public:
WorksetId^ GetActiveWorksetId()
member GetActiveWorksetId : unit -> WorksetId
Return Value
WorksetId
 WorksetId of the active workset.
Example
public Workset GetActiveWorkset(Document doc)
{
    // Get the workset table from the document
    WorksetTable worksetTable = doc.GetWorksetTable();
    // Get the Id of the active workset
    WorksetId activeId = worksetTable.GetActiveWorksetId();
    // Find the workset with that Id
    Workset workset = worksetTable.GetWorkset(activeId);
    return workset;
}
Public Function GetActiveWorkset(doc As Document) As Workset
    ' Get the workset table from the document
    Dim worksetTable As WorksetTable = doc.GetWorksetTable()
    ' Get the Id of the active workset
    Dim activeId As WorksetId = worksetTable.GetActiveWorksetId()
    ' Find the workset with that Id
    Dim workset As Workset = worksetTable.GetWorkset(activeId)
    Return workset
End Function
No code example is currently available or this language may not be supported.
No code example is currently available or this language may not be supported.
See Also
Reference
WorksetTable Class
Autodesk.Revit.DB Namespace